'use strict';
let messageBoxList = [
  'Завше поводься зі зброєю як із зарядженою!!!',
  'Не став пальця на спусковий гачок, якщо не збираєшся стріляти!',
  'Контролюй що знаходиться до цілі і за ціллю!',
  'Не направляй зброю туди, куди не збираєшся стріляти!',
  'НЕ БУХАЙ !!! ІЗ-ЗА ЦЬОГО МОЖЕ ПОМЕРТИ ПОБРАТИМ!!!',
  'НЕ КУРИ ТРАВУ!!! НЕ ПІДСТАВЛЯЙ БРАТІВ!!!',
  'ХОДИ В БРОНІКУ І КАСЦІ!!!',
  'Бережи екіпіровку!!!',
  'ВЧИСЯ!!! ВЧИСЯ!!! ВЧИСЯ!!!',
  'НЕ ЛІНУЙСЯ копати!!!',
  'Навіть по РОПУ старайтесь пересуватись по-двоє',
  'Біжи запитай у братюні де у вас точка евакуації... Не знає? Ідіть до взводного нехай покаже...',
  'Якщо ти з радєйкою, періодично перевіряй, що не збилась хвиля!',
  'Не стріляй "по-сомалійські" - це неефективно, це тупо!',
  'Стрільба зі стрілецької зброї вночі без спеціальних приладів (або без трасера по цілевказанню) не має жодного змісту. Якщо не ставилась така задача. Скоріш за все ти не попадаєш.',
  'Ну може досить вже стріляти з підствольника на 700м?!? Граната не долітає на таку відстань... Бережи "ВОГи".',
  'Щоб почати стріляти, ти як мінімум маєш знати відстань до цілі, щоб виставити відповідний приціл... Вивчай схему орієнтирів!',
  'Служба означає служіння. На благо іншим, іноді всупереч власним інтересам...',
];
let openOrNot = Math.floor(Math.random() * 4);

if (openOrNot === 0) {
  $('.messageBox').toggleClass('invisible');
  let number = Math.floor(Math.random() * messageBoxList.length);
  let par = document.getElementsByClassName('messageBox__text');
  let text = messageBoxList[number];
  par[0].innerText = `${text}`;
}

$('.messageBox__btn').click(function (event) {
  $('.messageBox').toggleClass('invisible');
});
